{
  "common": {
    "welcome": "Bienvenido a Tu Aplicación Web",
    "home": "Inicio",
    "blog": "Blog",
    "projects": "Trabajo",
    "menu": "Menú"
  },
  "about": {
    "greeting": {
      "hello": "Hola, Soy",
      "role": "Ingeniero de Software Senior",
      "title": "Apasionado por crear experiencias web increíbles."
    },
    "title": "Sobre Mí",
    "intro": "Soy un entusiasta del código con más de 15 años de experiencia convirtiendo café en aplicaciones web de alto rendimiento. No tengo superpoderes, pero me encanta crear experiencias de usuario fluidas como el agua. He tenido el privilegio de trabajar con marcas geniales como Autodesk, General Motors, Frontier, Carnival Cruise, Telmex, Presidencia de México y Coca-Cola.",
    "whatIDo": "Lo Que Hago",
    "skills": {
      "fullStack": "Desarrollo full-stack con enfoque en front-end",
      "design": "Convierto ideas de diseñadores y productos en aplicaciones completamente funcionales con gran atención al diseño",
      "performance": "Creo sitios web rápidos y de alto rendimiento con tráfico pesado",
      "problemSolving": "Resuelvo problemas complejos y lidero equipos pequeños"
    },
    "myToolbox": "Mi Caja de Herramientas",
    "toolbox": {
      "frontend": {
        "title": "Frontend",
        "tools": ["React", "TypeScript", "JavaScript", "Next.js", "Redux", "HTML", "CSS", "Tailwind", "MUI", "Wordpress", "jQuery"]
      },
      "backend": {
        "title": "Backend",
        "tools": ["Node.js", "Express", "Python", "NoSQL", "REST", "GraphQL"]
      },
      "performance": {
        "title": "Rendimiento y Optimización",
        "tools": ["Diseño de Sistemas", "Rendimiento", "Webpack", "SEO", "PWA", "Lighthouse", "SSR"]
      },
      "design": {
        "title": "Diseño y UX",
        "tools": ["Figma", "Adobe XD", "Diseño Responsivo", "Principios de UI/UX", "Diseño Gráfico"]
      },
      "devops": {
        "title": "DevOps",
        "tools": ["Docker", "Jenkins", "CI/CD", "GIT", "Netlify", "Vercel", "AWS"]
      },
      "build": {
        "title": "Herramientas de Construcción",
        "tools": ["Webpack", "Babel", "Rollup", "Eslint", "PostCSS", "Lerna", "SASS"]
      },
      "security": {
        "title": "Seguridad, Pruebas y Autenticación",
        "tools": ["Cypress", "Playwright", "Jest", "OAuth", "JWT", "SSO", "OWASP", "CORS"]
      },
      "mobile": {
        "title": "Móvil y Escritorio",
        "tools": ["React Native", "Electron", "Flutter"]
      }
    },
    "funFacts": {
      "title": "Datos Curiosos",
      "languages": "Fluido en inglés, español y JavaScript",
      "power": "Impulsado por código, café y música",
      "music": "Banda sonora para depurar: Música ambiental y John Coltrane",
      "hobby": "Cuando no estoy programando, me encontrarás jugando tenis de mesa"
    },
    "connect": "¡Conectemos!"
  },
  "blog": {
    "readMore": "Leer Más"
  },
  "work": {
    "title": "Experiencia laboral",
    "description": "Aquí están algunos de los proyectos en los que he trabajado. Haz clic en las pestañas para aprender más sobre cada proyecto.",
    "companies": [
      {
        "title": "Freelance",
        "period": "Julio 2024 - Presente",
        "location": "San Francisco, CA",
        "role": "Desarrollador Full Stack & Diseñador UI/UX",
        "description": "<li>Trabajando como freelancer creando aplicaciones web y diseñando para diferentes clientes y proyectos</li>",
        "tags": ["Next.js", "React", "TypeScript", "Node.js", "Firebase", "React Native", "Tailwind CSS", "Angular", "Figma", "Adobe XD"]
      },
      {
        "title": "Globant",
        "period": "Ago 2015 - Julio 2024",
        "location": "Dallas, TX / San Francisco, CA",
        "role": "Ingeniero de Software Senior Nivel II",
        "description": "<li>Responsable de la planificación y ejecución de la aplicación de una sola página de perfil de alto tráfico de Autodesk, lo que resultó en una mejora del 30% en el rendimiento, un diseño de marca más unificado y una mejor experiencia de usuario utilizando React, GraphQL, Node, AWS, Microservicios.</li> <li>Desarrollo de un módulo de paquete altamente configurable y una biblioteca de componentes reutilizables, lo que permitió una fácil integración en otros proyectos por equipos externos. Este módulo permite a los usuarios actualizar y guardar sus configuraciones y preferencias de perfil.</li> <li>Líder del equipo en el diseño y desarrollo de un blog de WordPress para Frontier Communications, reconocido como finalista para el Mejor Blog 2020 en los US Social Media Awards en Pub-Con.</li> <li>Líder técnico para la aplicación de cine de Carnival Cruise, que permitió elegir películas, leer reseñas, ver tráilers, obtener horarios, comprar boletos y canjearlos en el cine utilizando Angular como el framework front-end y API REST.</li> <li>Desarrollo de una herramienta interactiva con D3.js y AngularJS que permitió visualizar todos los diferentes productos y sus interrelaciones a través de un gráfico de árbol animado para Autodesk PLM 360.</li>",
        "tags": [
          "React",
          "TypeScript",
          "GraphQL",
          "Node.js",
          "Express",
          "MongoDB",
          "Tailwind CSS",
          "AWS",
          "D3.js",
          "Angular",
          "WordPress",
          "Jenkins",
          "CI/CD",
          "Docker",
          "Lerna",
          "SASS"
        ]
      },
      {
        "title": "5M2",
        "period": "Feb 2014 - Ago 2015",
        "location": "Ciudad de México, México",
        "role": "Desarrollador Front End Sr.",
        "description": "<li>Supervisión del desarrollo front-end de GOB.mx. Transformación de muchos trámites gubernamentales de presenciales a digitales, mejorando la accesibilidad y eficiencia para cientos de millones de usuarios, centrándose en el rendimiento, la experiencia de usuario y la accesibilidad.</li> <li>Dirigió la creación de un marco de guía de estilo para agencias y ministerios de la administración pública. Organizó y lideró reuniones con directores técnicos de todo el país, implementando con éxito un diseño de marca unificado con un código detallado y pautas de integración a nivel nacional.</li>",
        "tags": ["AngularJS", "Bootstrap", "SASS", "Grunt", "Ruby on Rails", "WordPress"]
      },
      {
        "title": "Telmex",
        "period": "Mayo 2013 - Ene 2014",
        "location": "Ciudad de México, México",
        "role": "Desarrollador Front End Sr.",
        "description": "<li>Contribuyó al rediseño y reconstrucción de telmex.com, transformándolo efectivamente en uno de los sitios web más visitados de América Latina.</li>",
        "tags": ["Liferay", "Bootstrap", "SASS", "Grunt", "jQuery", "JavaScript"]
      },
      {
        "title": "Interalia",
        "period": "Ene 2010 - Mayo 2013",
        "location": "Ciudad de México, México",
        "role": "Diseñador Web Sr. / Desarrollador Front End",
        "description": "<li>Desarrollo de múltiples sitios web que promocionaban diferentes nuevas marcas y modelos de General Motors como Chevrolet, Buick y Cadillac utilizando JS puro y jQuery para sus sitios altamente interactivos.</li><li>Dirigió el diseño y desarrollo de micro-sitios, campañas web, páginas de fans y sitios móviles para Coca-Cola Latinoamérica.</li><li>Rediseño del logo y la marca de la empresa, siendo seleccionado entre docenas de otras propuestas hechas por otros diseñadores gráficos.</li>",
        "tags": ["ActionScript 3", "HTML5", "jQuery", "CSS3", "Objective-C", "JavaScript"]
      }
    ]
  },
  "projects": {
    "title": "Proyectos Destacados",
    "description": "Aquí están algunos de los proyectos en los que he trabajado.",
    "apps": [
      {
        "title": "Perfil Autodesk",
        "description": "Un enfoque centrado en el usuario que equilibraba funcionalidad y atractivo estético. Utilizando Figma para el diseño y siguiendo las directrices de la marca de Autodesk, participamos en discusiones continuas para tomar decisiones informadas sobre el diseño e implementación de la aplicación. Esta estrecha colaboración garantizó que tanto los aspectos técnicos como visuales se integraran a la perfección, resultando en una aplicación robusta e intuitiva que cumplió con las necesidades de rendimiento y usabilidad de los usuarios de alto tráfico.",
        "image": "/images/work/profile.jpg",
        "tools": [
          "React",
          "GraphQL",
          "Node.js",
          "AWS",
          "Microservicios",
          "Material UI",
          "Figma",
          "Serverless",
          "Microfrontend",
          "TypeScript"
        ],
        "liveLink": "https://profile.autodesk.com"
      },
      {
        "title": "Blog Frontier",
        "description": "Mi solución creativa para el proyecto involucró dar vida a las ideas de los propietarios del producto con un fuerte enfoque en la experiencia del usuario. Fui responsable de crear flujos de usuario detallados y wireframes, diseñar maquetas de alta fidelidad y liderar un pequeño equipo de desarrollo para construir el proyecto. Desarrollamos una plantilla personalizada de WordPress adaptada a nuestras necesidades, asegurando una experiencia de usuario fluida y atractiva. Nuestros esfuerzos culminaron con el blog siendo finalista al Mejor Blog 2020 en los US Social Media Awards de Pub-Con, reflejando el éxito e impacto de nuestro trabajo.",
        "image": "/images/work/frontier.jpg",
        "tools": ["React", "WordPress", "jQuery", "SASS", "PHP", "UI/UX"],
        "liveLink": "https://blog.frontier.com"
      }
    ]
  }
}
